[
  {
    "id": 1,
    "title": "Coping up with college stress",
    "author": "author A",
    "content": "> Stress is a mental situation in which a person feels ***overwhelmed*** and is unable to work productively. It is one of the most common ***psychological problem*** faced by humans these days\n\n# How it happens\n\nThere can be many reasons why college students might get stressed. It might be that they are unable to finish their project. Or maybe they are not able to get good scores in exams. Some might be stressed due to competition for internships and jobs. There might also be many personal reasons which act as precursors for stress.\n\n# Coping up with stress\n\nThere are some well tested ways to cope up with stress, they are: -\n\n## Physical workout\n\nAlthough not very obvious, but few minutes of exercise can help to reduce stress levels significantly.\n\n## Keeping a hobby\n\nA hobby such as dancing, reading, debating etc. can help a person to not lose the purpose of life and it helps keep him or her motivated.\n\n# What to do if my friend/ family member is stressed?\n\nIn such a case, you should try to make them talk out their problems, many times this itself can heal the other person. You can give your own example to make them realize that such a situation is common and it will pass on. You should try to motivate them but at the same time also provide them some personal time in which they can reflect upon themselves.",
    "discussions": [
      {
        "id": 1,
        "content": "Wow it was a ***great*** post",
        "author": "author B",
        "replies": []
      },
      {
        "id": 2,
        "content": "Good to know about it. What about *school stress*?",
        "author": "author C",
        "replies": [
          {
            "id": 1,
            "content": "Almost ***same points*** will follow for school also",
            "author": "author A"
          }
        ]
      }
    ],
    "tags": ["stress", "psychology", "improvement", "self-help", "motivation"],
    "coverImgFull": ""
  },
  {
    "id": 2,
    "title": "How to expand your network",
    "author": "author B",
    "content": "# Why to expand network\n\nA large network in college life is a must. It helps in following manner\n* Making new friends\n* Getting help in difficult times\n* Getting inspiration from seniors\n* and a lot more! (give more ideas in discussions)\n\n# How to\n\nComing to the main question, expanding a network is an art. It requires good communication skills and presence of mind. Some useful steps you can follow are\n* Talk to seniors and your teachers\n* Help your friends in need\n* Become active on social media (but be careful to not get distracted! Use social media like linkedin or `this app`.\n\n# Further points\nAlways be careful that not all people are helpful and supportive. If you feel uncomfortable about someone then do not fear in breaking bond with that person even if your network gets harmed.",
    "discussions": [
      {
        "id": 1,
        "content": "We also need to expand network for internships / jobs!",
        "author": "author C",
        "replies": [
          {
            "id": 1,
            "content": "I agree!",
            "author": "author D"
          },
          {
            "id": 2,
            "content": "Well said!",
            "author": "author B"
          }
        ]
      },
      {
        "id": 2,
        "content": "Thank you so much, it really helped",
        "author": "author A",
        "replies": [
          {
            "id": 1,
            "content": "Happy to help!",
            "author": "author B"
          }
        ]
      }
    ],
    "tags": ["networking", "coding", "placement"],
    "coverImgFull": ""
  },
  {
    "id": 3,
    "title": "Approaches to learn coding",
    "author": "author C",
    "content": "# Why coding is important\n\nCoding has, in recent times, become an essential skill which everyone should know. It gives the capability to utilize the speed and accuracy of computers. It can benefit in automating mundane tasks. E.g., if you get a homework to compute 5 complex integrals which are similar, like \n\n $ \\int_0^{\\infty} \\left( \\frac{1}{t^4} \\right) dt $ \n\n or maybe you have to draw graph of a function like \n\n $ f(x) = \\begin{cases} x^2 \\text{, } x \\le 4 \\\\ 2x-x^3 \\text{, } 2 \\le x \\le 5 \\\\ 0 \\text{, } x \\gt 5 \\end{cases} $ \n\n you could just write a program and automate your task! \n\n > For engineers, coding is a must since it is one of those technical skills which can help on a long run.\n\n# Ways to learn coding\n\nThere can be different ways to learn coding, they depend upon the final place one wants to reach.\n* For automating day to day tasks: In such a case, python is the best language to begin with. It has an easy to read syntax and many pre-built libraries. A hello world program in python is like this\n\n```py\nprint(\"Hello World\")\n```\n* For making performant/ business quality programs: In such a case, one of the best approach is to start learning with C and C++ and then move on to higher level languages. A hello world program in C would be like\n```c\n#include<stdio.h>\n\nint main() {\n\treturn 0;\n}\n```\n\n# Conclusion\n\nTherefore, we finally conclude that the perfect way to learn coding is different for different people and you should take the pathway that you like the most.",
    "discussions": [
      {
        "id": 1,
        "content": "You can also include languages like go and rust since they are used quite a lot nowadays",
        "author": "author A",
        "replies": [
          {
            "id": 1,
            "content": "I agree. A hello world program in rust will be like\n```rust\nfn main() {\n\tprintln!(\"Hello World\");\n}\n```\n\n Similarly, in go, hello world program is \n```go\npackage main\n\nimport \"fmt\"\n\nfunc main() {\n\tfmt.Println(\"Hello World\")\n}\n```",
            "author": "author C"
          }
        ]
      }
    ],
    "tags": ["coding", "learning", "studies", "placement"],
    "coverImgFull": ""
  },
  {
    "id": 4,
    "title": "How to get good CGPA",
    "author": "Nikhil",
    "content": "# Go Through Your Syllabus Properly\n\nBefore diving into your studies, it's crucial to have a clear understanding of your syllabus. Knowing what topics and subjects you need to cover will allow you to create a ***structured study plan***. Carefully review your course outline to ensure you don't miss any important areas.\n\n# Refer to Previous Year Question Papers for Practice\n\n*Practice makes perfect*, and one of the best ways to prepare for exams is by solving previous year's question papers. These papers provide insights into the exam pattern, question types, and the level of difficulty you can expect. Use them to gauge your knowledge and ***identify areas that need improvement***.\n\n# Make Proper Notes\n\nEffective note-taking is a skill that can significantly boost your understanding of complex subjects. Create ***concise, organized notes*** for theoretical subjects. For subjects like mathematics, in addition to notes, practice solving a variety of problems to gain a deeper understanding of the concepts.\n\n# Analyze Properly for Weightage\n\nNot all topics carry the same weightage in exams. Some subjects may have more marks allocated to specific chapters or units. Analyze past exam patterns or consult your teachers to identify which topics hold the most weight. Allocate more of your study time to these high-value areas.\n\n# Create and Follow a Timetable\n\nA well-structured timetable is your roadmap to success. Create a daily or weekly schedule that allocates specific time slots for each subject and activity. Ensure you have a ***balanced routine*** that includes study, breaks, and relaxation. Display your timetable in your study area as a constant reminder.\n\n# Avoid Procrastination\n\n***Procrastination is the enemy of productivity***. Train yourself to stay focused and disciplined. Set ***small, achievable goals*** for each study session, and reward yourself when you accomplish them. Identify your most productive times of the day and prioritize challenging subjects during those periods.\n\n# Seek Help When Needed\n\nDon't hesitate to seek help from your teachers or peers when you encounter difficulties. If you're unable to solve certain questions or concepts remain unclear, approach your teachers for clarification. They are there to support your learning journey.\n\n>Getting a good CGPA requires ***dedication***, ***discipline***, and ***effective study techniques***. By understanding your syllabus, practicing with previous year's question papers, making organized notes, prioritizing high-weightage topics, adhering to a well-structured timetable, avoiding procrastination, and seeking assistance when needed, you can significantly improve your academic performance. Remember that ***consistency and perseverance*** are key to achieving your goal of a high CGPA.",
    "discussions": [
      {
        "id": 1,
        "content": "Thanks!",
        "author": "Manikya",
        "replies": [{ "id": 1, "content": "👍👍", "author": "Nikhil" }]
      },
      {
        "id": 2,
        "content": "Aapse better kon hi likhega",
        "author": "Lavya",
        "replies": [
          { "id": 1, "content": "Are are guru ji😂", "author": "Nikhil" }
        ]
      },
      {
        "id": 3,
        "content": "Aree bhaisahab",
        "author": "Lavya",
        "replies": []
      }
    ],
    "tags": ["studies", "strategy", "exams", "improvement", "motivation"],
    "coverImgFull": "https://images.unsplash.com/photo-1456513080510-7bf3a84b82f8?crop=entropy&cs=srgb&fm=jpg&ixid=M3w1MTEwNTR8MHwxfHNlYXJjaHwxfHxzdHVkeXxlbnwwfHx8fDE2OTYzNDIxODd8MA&ixlib=rb-4.0.3&q=85"
  }
]
